x = [1.0, 1.1, 1.2, 1.3, 1.4, 1.5, 1.6, 1.7, 1.8, 1.9,
     2.0, 2.1, 2.2, 2.3, 2.4, 2.5, 2.6, 2.7, 2.8, 2.9, 3.0]

y = [1.2661, 1.3262, 1.3937, 1.4693, 1.5534, 1.6467, 1.7500, 1.8640, 1.9896, 2.1277,
     2.2796, 2.4463, 2.6291, 2.8296, 3.0493, 3.2898, 3.5533, 3.8417, 4.1573, 4.5027, 4.8808]

h = 0.1
xx = 1.8

# 1) Таблиця y' за формулою (5.7): y'(x_i) = (y_{i-2} - 8y_{i-1} + 8y_{i+1} - y_{i+2}) / (12h)

print("1) Таблиця значень y' за формулою (5.7)")
print("k\t x\t y\t\t y'")

for k in range(17):
    i = k + 2
    xi = 1.2 + 0.1 * k
    y1 = (y[i-2] - 8*y[i-1] + 8*y[i+1] - y[i+2]) / (12*h)
    print(f"{k}\t {xi:.1f}\t {y[i]:.4f}\t {y1:.6f}")

# 2) Таблиця y'' за формулою (5.12): y''(x_i) = (y_{i-1} - 2y_i + y_{i+1}) / h^2

print("\n2) Таблиця значень y'' за формулою (5.12)")
print("k\t x\t y''")

for k in range(17):
    i = k + 2
    xi = 1.2 + 0.1 * k
    y2 = (y[i-1] - 2*y[i] + y[i+1]) / (h**2)
    print(f"{k}\t {xi:.1f}\t {y2:.6f}")

# 3) y'(xx)

k0 = int((xx - 1.2) / 0.1)
i0 = k0 + 2

# формула Ньютона

Dy0  = y[i0+1] - y[i0]
Dy1  = y[i0+2] - y[i0+1]
Dy2  = y[i0+3] - y[i0+2]
Dy3  = y[i0+4] - y[i0+3]

D2y0 = Dy1 - Dy0
D2y1 = Dy2 - Dy1
D2y2 = Dy3 - Dy2

D3y0 = D2y1 - D2y0
D3y1 = D2y2 - D2y1

D4y0 = D3y1 - D3y0

y1_newton = (Dy0 - 0.5*D2y0 + (1/3)*D3y0 - 0.25*D4y0) / h

print("\n3) Значення y'(1.8)")
print(f"За формулою Ньютона: y'(1.8) = {y1_newton:.6f}")

# формула Стірлінга

Dy_m1 = y[i0]   - y[i0-1]
Dy_0  = y[i0+1] - y[i0]

Dy_m2 = y[i0-1] - y[i0-2]
Dy_p1 = y[i0+2] - y[i0+1]

D2y_m2 = Dy_m1 - Dy_m2
D2y_m1 = Dy_0  - Dy_m1
D2y_0  = Dy_p1 - Dy_0

D3y_m2 = D2y_m1 - D2y_m2
D3y_m1 = D2y_0  - D2y_m1

y1_stirling = ((Dy_m1 + Dy_0)/2 - (D3y_m2 + D3y_m1)/12) / h

print(f"За формулою Стірлінга: y'(1.8) = {y1_stirling:.6f}")

# 4) y''(хх)

y2_xx = (y[i0-1] - 2*y[i0] + y[i0+1]) / (h**2)

print(f"\n4) y''(1.8) = {y2_xx:.6f}")
